{
   "intro":{
      "prose_1":"As a group of ambitious statistics and computer science students first stepping foot into the world of data analysis and visualization, it would be an understatement to describe us as a group of kids in a candy shop. With a fresh understanding of statistical analysis softwares in a world where datasets are as plentiful as tweets about Donald Trump, we are excited to present our findings from our little niche of Spotify data.",
      "prose_2":"Inspired by our own avid use of Spotify, we first wanted to delve into user behavior of Spotify, including streaming trends in response to significant events and day to day listening patterns."
   },
   "top_streams":{
      "title":"On today's date in 2017",
      "prose_1":"The most streamed artists in 2017 were Drake, Post Malone, Ed Sheeran, The Chainsmokers, and Ozuna--many of whom you may have guessed. Amongst Spotify listeners, we can see that the streaming popularity of these artists have peaks and lows throughout different times of the year.",
      "prose_2":"Jump to 'Selected Artists' to explore why Lil Peep and XXXTentacion's streams varied by their personal life events."
   },
   "week_ratios":{
      "title":"Artists with More Weekend Streams than Weekday Streams",
      "prose_1":"You might guess that some artists' styles are better-recieved on the weekends rather than weekdays. Maybe their styles tend to go better with events (or feelings!) that occur after the work week. To explore this, we found artists whose listeners tend to stream their music more on weekends than weekdays.",
      "prose_2":"Let's consider the most popular artists on Spotify's Top 200 chart. We compare each artist's average number of weekend streams to average number of weekday streams using a ratio. Larger ratios represent a greater difference in the average number of streams between weekends and weekdays.",
      "prose_3":"For example, Post Malone's ratio (1.08) indicates that people tended to stream Post Malone 8% more on weekends than weekdays. The plot above shows the artists with the greatest weekend to weekday stream ratios."
   },
   "song_features":{
      "prose_1":"Why did Drake and Ariana Grande have more streams on weekends than weekdays than other artists? We suspect that music with more party-like qualities are streamed more on weekends, so we looked to the trends of song characteristics throughout the week.",
      "prose_2":"We can see that songs played on the weekend tend to exhibit higher levels of party-like qualities including danceability, liveness, valence, speechiness, and loudness. The duration of songs also decreased quite a bit on Fridays and Saturdays, which could be because party-like songs tend to be shorter. The acoustic trend appears to be nearly directly inverse of the danceability trend throughout the week, suggesting that these characteristics tend to not co-occur."
   },
   "lil_peep":{
      "prose_1":"Lil Peep was a mostly underground artist before his death. After his death, many people started to listen to more of this music and he gained a lot of fame. Let's see if this is reflected on the Spotify top charts."
   },
   "x":{
      "prose_1":""
   }
}