{
   "intro":{
      "prose_1":"As a group of ambitious statistics and computer science students first stepping foot into the world of data analysis and visualization, it would be an understatement to describe us as a group of kids in a candy shop. In a world where datasets are as plentiful as Donald Trump's tweets, we opted to wield our own data to present new angles on Spotify data.",
      "prose_2":"Inspired by our own avid use of Spotify, we first wanted to delve into user behavior of Spotify, including streaming trends in response to significant events and day to day listening patterns."
   },
   "top_streams":{
      "title":"On ",
      "prose_1":"The most streamed artists in 2017 were Drake, Post Malone, Ed Sheeran, The Chainsmokers, and Ozuna—many of whom you may have guessed. Among Spotify listeners, the streaming popularity of these artists have peaks and lows throughout different times of the year.",
      "prose_2":"Jump to 'Selected Artists' to explore why Lil Peep and XXXTentacion's streams varied by their personal life events."
   },
   "week_ratios":{
      "title":"Artists with More Weekend Streams than Weekday Streams",
      "prose_1":"You might guess that some artists' styles are better-recieved on the weekends rather than weekdays. Maybe their styles tend to go better with events (or feelings!) that occur after the work week. To explore this, we found artists whose listeners tend to stream their music more on weekends than weekdays.",
      "prose_2":"Let's consider the most popular artists on Spotify's Top 200 chart. We compared each artist's average number of weekend streams to average number of weekday streams using a ratio. Larger ratios represent a greater difference in the average number of streams between weekends and weekdays.",
      "prose_3":"For example, Post Malone's ratio (1.07) indicates that people tended to stream Post Malone 7% more on weekends than weekdays. The plot below shows the artists with the greatest weekend to weekday stream ratios.",
      "prose_4": "The artists with the smallest ratios (below) indicate that their listeners are more weekday listeners. Notice that these artists produced much older music, which suggests a different demographic of listeners."
   },
   "song_features":{
      "prose_1":"Why did Drake and Ariana Grande have more streams on weekends than weekdays than other artists? You might suspect that music with more party-like qualities are streamed more on weekends, so we looked to the trends of song characteristics throughout the week.",
      "prose_2":"We can see that songs played on the weekend tend to exhibit higher levels of party-like qualities including danceability, liveness, valence, speechiness, and loudness. The duration of songs also decreased quite a bit on Fridays and Saturdays, which could be because party-like songs tend to be shorter. The acoustic trend appears to be nearly directly inverse of the danceability trend throughout the week. This means that when people listen to highly acoustic music during the week, they tend to not listen to as much danceable music and vice versa."
   },
   "lil_peep": {
      "title": "Lil Peep's Popularity Posthumously",
      "prose_1":"Lil Peep was a mostly underground artist before his death. After his death, many people started to listen to more of this music and he gained a lot of fame. Let's see if this is reflected on the Spotify top charts.",
      "prose_2": "After Lil Peep’s fatal drug overdose on November 15, 2017 (test your drugs), he suddenly appears on Spotify’s top 200 chart and began gaining streams. Our sorrows were short lived as he disappeared from the charts just over a month later, not to be seen again until the posthumous release of Falling Down with XXXTentacion. Whether it was his own fame or XXXTentacion’s talent that drove up the streams we won’t say--but we will say that the release of his final album Come Over when You’re Sober, did not stop his downward trend off the charts."
   },
   "x":{
      "title": "XXXTentacion's Popularity by Album Drops",
      "prose_1":"Similarly, we see a spike in streams at each of XXXTentacion’s album drops and after his death in which his average number of streams remains higher than his previous trend. We can also see a mini spike in streams around March 2 just before ? dropped due to the release of--you guessed it--SAD!"
   },
   "travis": {
      "title":"Do Certain Artists Release Music Cyclically, Staying in the Top 200's Chart?",
      "prose_1": "How do songs by artists with multiple USA Top 200 hits in this time frame interact with each other over time? Are top hits by the same artist usually on the charts together? Knowing the history and chart tendencies of an artist can help us predict when they will release music again. \nLet’s see if there are any consistent trends of Travis Scott’s top 5 songs.",
      "prose_2": "It appears that all of his top 5 songs are off of Astroworld, and all but the single Butterfly Effect appear on the chart after Astroworld was released. There does not appear to be any helpful predictive trend here--perhaps we will have more luck looking at other artists."
   }
}